#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_pet.secret_name: Refreshing state... [id=strangely-steady-monkfish]
random_password.master: Refreshing state... [id=none]
module.ingestion.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_partition.current: Reading...
aws_secretsmanager_secret.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
aws_api_gateway_api_key.api_gateway_api_key: Refreshing state... [id=bqz9cf6p6h]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Reading...
aws_api_gateway_deployment.api_gateway_deployment: Refreshing state... [id=xje8ny]
aws_api_gateway_usage_plan.api_gateway_usage_plan: Refreshing state... [id=mhz8po]
aws_api_gateway_usage_plan_key.api_gateway_usage_plan_key: Refreshing state... [id=bqz9cf6p6h]
aws_api_gateway_rest_api.api_gateway_rest_api: Refreshing state... [id=9bq31150jd]
aws_api_gateway_stage.api_gateway_stage: Refreshing state... [id=ags-9bq31150jd-dev]
module.inference.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.memory.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.list_collections.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-list-collections-dev]
data.aws_availability_zones.available: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.memory.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-memory-dev]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-lex-router-dev]
aws_db_parameter_group.default: Refreshing state... [id=rds-pg]
module.inference.module.lambda_function_container_image.data.aws_region.current: Reading...
module.inference.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_ami.latest_amazon_linux: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.ingestion.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.inference.module.api_gateway.data.aws_caller_identity.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.aws_sqs_queue.dead_letter_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev_dead_letter]
module.inference.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.list_collections.module.api_gateway.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.memory.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.data.aws_ecr_image.lambda_image: Reading...
module.inference.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.data.aws_ecr_image.lambda_image: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1348983281]
module.memory.aws_dynamodb_table.basic-conversation_memory_table-table: Refreshing state... [id=levio-demo-fev-chat-history-dev]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.aws_s3_bucket.ingestion_source_storage: Refreshing state... [id=levio-demo-fev-storage-dev]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-00fb300ee2d2f7b3b]
module.ingestion.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:ee2f0374fc2fc36144fa5c1fcdf09a3cb0d805427f3414d0f964efaf693d6061]
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=3277652423]
module.inference.data.aws_ecr_image.lambda_image: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.inference.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-inference-dev]
module.list_collections.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:d10e33d62a6d9a423740500f17198bb0b698846bca4becfff1d27ba2ba7125b8]
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ingestion.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/levio-demo-fev-ingestion-dev]
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_caller_identity.current: Read complete after 0s [id=446872271111]
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_partition.current: Read complete after 0s [id=aws]
module.inference.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role]
module.lex_router.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:d5adf813497e6fc2e24d9dd593c412f0aa9ee279057eb725fbe7aa7e0e976fe1]
module.memory.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role]
data.aws_secretsmanager_secret.password: Reading...
aws_secretsmanager_secret_version.password: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|terraform-20240126151709956800000002]
module.memory.data.aws_ecr_image.lambda_image: Read complete after 1s [id=sha256:17f7da23e51e44c266fc0368b1fc0faf5610ddd62d7b155b525c20caa65933df]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-inline]
data.aws_ami.latest_amazon_linux: Read complete after 1s [id=ami-03c951bbe993ea087]
module.lex_router.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role]
module.inference.data.aws_ecr_image.lambda_image: Read complete after 0s [id=sha256:43da6fca8ae25ff2acf5dad0391d0c36356ed3720bb7ec7887d70a1ddd79c4a9]
module.memory.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-inline]
module.ingestion.aws_sqs_queue.queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
data.aws_secretsmanager_secret.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD]
module.list_collections.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role]
module.ingestion.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role]
data.aws_secretsmanager_secret_version.password: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=736838273]
module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=dv0h4c]
module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource: Refreshing state... [id=c4yu2h]
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.memory.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3522429600]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=52771042]
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.lex_router.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3953744684]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-logs]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=2926739739]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512646400000001]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Reading...
data.aws_secretsmanager_secret_version.password: Read complete after 0s [id=arn:aws:secretsmanager:us-east-1:446872271111:secret:vectordb-password-main-strangely-steady-monkfish-dKgTZD|AWSCURRENT]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710029800000004]
module.ingestion.data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=1366123725]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-logs]
module.memory.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-memory-dev-role-logs]
module.lex_router.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-lex-router-dev-role-logs]
module.inference.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-logs]
module.ingestion.aws_sqs_queue_policy.sqs_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/446872271111/levio-demo-fev-ingestion-queue-dev]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-9bq31150jd-dv0h4c-OPTIONS]
module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-9bq31150jd-c4yu2h-GET]
module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method: Refreshing state... [id=agm-9bq31150jd-dv0h4c-GET]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-9bq31150jd-c4yu2h-OPTIONS]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-9bq31150jd-c4yu2h-OPTIONS-200]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-9bq31150jd-c4yu2h-OPTIONS]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240130201651725000000001]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-20240126151710029200000003]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-20240126151710031000000005]
module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-9bq31150jd-dv0h4c-OPTIONS]
module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-9bq31150jd-dv0h4c-OPTIONS-200]
module.inference.module.api_gateway.aws_lambda_permission.lambda_permission: Refreshing state... [id=AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev]
module.memory.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-memory-dev-role-20240126151710095500000006]
module.lex_router.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev-role-20240202183512785600000002]
module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-9bq31150jd-c4yu2h-OPTIONS-200]
module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-9bq31150jd-dv0h4c-OPTIONS-200]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0b9066ddfe118437e]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0d7ddd92ffe7cad50]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bbe5e0845bba1093]
module.vpc.aws_route_table.database[1]: Refreshing state... [id=rtb-00ef44a2d775aaa99]
aws_security_group.sm_sg: Refreshing state... [id=sg-013ee0bdd16b8366f]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-086b3e733d88fa370]
aws_security_group.lambda_egress_all_sg: Refreshing state... [id=sg-054f9a76901acf353]
module.vpc.aws_route_table.database[0]: Refreshing state... [id=rtb-0f03a46a772c6a571]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-09be498e3f465bbb5]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-04aae6346ab85dfe5]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-03f5acb4bc8b5d586]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0d1f5f95132e695a6]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02f9981846a152b24]
aws_security_group.jumpbox_sg: Refreshing state... [id=sg-0b9900b5db426c576]
aws_security_group.bedrock_sg: Refreshing state... [id=sg-0902cb6d437a968b6]
aws_security_group.dynamo_db_sg: Refreshing state... [id=sg-0c6d3637458aa4799]
aws_vpc_endpoint.secrets_manager_endpoint: Refreshing state... [id=vpce-07b8182fd57a40bc7]
aws_vpc_endpoint.lambda_endpoint: Refreshing state... [id=vpce-0b1660c4cfd3c329e]
module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-lex-router-dev]
module.memory.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-memory-dev]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=ex-terraform-dev]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-0d7135c7f623e06f8]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-044bfd1713e1c30ec]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0db0a8005c04ca4f2]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-066d9aa6005ec7c94]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02f9981846a152b241080289494]
aws_vpc_endpoint.bedrock_endpoint: Refreshing state... [id=vpce-0a8ed6effde8d7daf]
aws_security_group.database_sg: Refreshing state... [id=sg-02511ace313a817bd]
aws_instance.jumpbox: Refreshing state... [id=i-0cd5eadbd064719b1]
aws_vpc_endpoint.s3_endpoint: Refreshing state... [id=vpce-0fdf03f021658d47f]
aws_vpc_endpoint.dynamo_db_endpoint: Refreshing state... [id=vpce-04b83095daf470dae]
aws_db_instance.vector_db: Refreshing state... [id=db-KTG3TDKXH3C3BOXFTTIFJ5SASY]
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Reading...
module.list_collections.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=1333636943]
module.list_collections.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-list-collections-dev-role-inline]
module.inference.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=242001761]
module.ingestion.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0]: Read complete after 0s [id=2560015702]
module.inference.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-inference-dev-role-inline]
module.ingestion.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::446872271111:policy/levio-demo-fev-ingestion-dev-role-inline]
module.list_collections.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev-role-20240202005532784400000004]
module.ingestion.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev-role-2024012615222186470000000d]
module.inference.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0]: Refreshing state... [id=levio-demo-fev-inference-dev-role-2024012615222187350000000e]
module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-ingestion-dev]
module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-list-collections-dev]
module.inference.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=levio-demo-fev-inference-dev]
module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-9bq31150jd-c4yu2h-GET]
module.ingestion.aws_lambda_event_source_mapping.event_source_mapping: Refreshing state... [id=ffdd3b10-6ac6-4fbf-bbd1-a7e6e82bf9d1]
module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration: Refreshing state... [id=agi-9bq31150jd-dv0h4c-GET]
module.ingestion.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=levio-demo-fev-storage-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ last_modified                  = "2024-02-09T23:18:54.000+0000" -> "2024-02-12T13:50:09.593+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ last_modified                  = "2024-02-09T23:18:49.000+0000" -> "2024-02-12T13:50:09.593+0000"
        tags                           = {}
        # (19 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_api_gateway_api_key.api_gateway_api_key will be destroyed
  # (because aws_api_gateway_api_key.api_gateway_api_key is not in configuration)
  - resource "aws_api_gateway_api_key" "api_gateway_api_key" {
      - arn               = "arn:aws:apigateway:us-east-1::/apikeys/bqz9cf6p6h" -> null
      - created_date      = "2024-02-12T13:50:08Z" -> null
      - description       = "Managed by Terraform" -> null
      - enabled           = true -> null
      - id                = "bqz9cf6p6h" -> null
      - last_updated_date = "2024-02-12T13:50:08Z" -> null
      - name              = "api_gateway_api_key" -> null
      - tags              = {} -> null
      - tags_all          = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null
      - value             = (sensitive value) -> null
    }

  # aws_api_gateway_api_key.this will be created
  + resource "aws_api_gateway_api_key" "this" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = "Managed by Terraform"
      + enabled           = true
      + id                = (known after apply)
      + last_updated_date = (known after apply)
      + name              = "api_gateway_api_key"
      + tags_all          = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + value             = (sensitive value)
    }

  # aws_api_gateway_deployment.api_gateway_deployment will be destroyed
  # (because aws_api_gateway_deployment.api_gateway_deployment is not in configuration)
  - resource "aws_api_gateway_deployment" "api_gateway_deployment" {
      - created_date  = "2024-02-12T13:50:09Z" -> null
      - execution_arn = "arn:aws:execute-api:us-east-1:446872271111:9bq31150jd/" -> null
      - id            = "xje8ny" -> null
      - invoke_url    = "https://9bq31150jd.execute-api.us-east-1.amazonaws.com/" -> null
      - rest_api_id   = "9bq31150jd" -> null
    }

  # aws_api_gateway_deployment.this will be created
  + resource "aws_api_gateway_deployment" "this" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # aws_api_gateway_rest_api.api_gateway_rest_api will be destroyed
  # (because aws_api_gateway_rest_api.api_gateway_rest_api is not in configuration)
  - resource "aws_api_gateway_rest_api" "api_gateway_rest_api" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-east-1::/restapis/9bq31150jd" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2024-02-12T13:50:08Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-1:446872271111:9bq31150jd" -> null
      - id                           = "9bq31150jd" -> null
      - name                         = "api_gateway_rest_api" -> null
      - root_resource_id             = "ic7gx3jk9f" -> null
      - tags                         = {} -> null
      - tags_all                     = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # aws_api_gateway_rest_api.this will be created
  + resource "aws_api_gateway_rest_api" "this" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "levio-demo-fev-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
    }

  # aws_api_gateway_stage.api_gateway_stage will be destroyed
  # (because aws_api_gateway_stage.api_gateway_stage is not in configuration)
  - resource "aws_api_gateway_stage" "api_gateway_stage" {
      - arn                   = "arn:aws:apigateway:us-east-1::/restapis/9bq31150jd/stages/dev" -> null
      - cache_cluster_enabled = false -> null
      - deployment_id         = "xje8ny" -> null
      - execution_arn         = "arn:aws:execute-api:us-east-1:446872271111:9bq31150jd/dev" -> null
      - id                    = "ags-9bq31150jd-dev" -> null
      - invoke_url            = "https://9bq31150jd.execute-api.us-east-1.amazonaws.com/dev" -> null
      - rest_api_id           = "9bq31150jd" -> null
      - stage_name            = "dev" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null
      - variables             = {} -> null
      - xray_tracing_enabled  = false -> null
    }

  # aws_api_gateway_stage.this will be created
  + resource "aws_api_gateway_stage" "this" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }
      + web_acl_arn   = (known after apply)
    }

  # aws_api_gateway_usage_plan.api_gateway_usage_plan will be destroyed
  # (because aws_api_gateway_usage_plan.api_gateway_usage_plan is not in configuration)
  - resource "aws_api_gateway_usage_plan" "api_gateway_usage_plan" {
      - arn      = "arn:aws:apigateway:us-east-1::/usageplans/mhz8po" -> null
      - id       = "mhz8po" -> null
      - name     = "api_gateway_usage_plan" -> null
      - tags     = {} -> null
      - tags_all = {
          - "Environment" = "dev-dev"
          - "Project"     = "levio-aws-demo-fev-dev"
          - "Terraform"   = "true"
        } -> null

      - api_stages {
          - api_id = "9bq31150jd" -> null
          - stage  = "dev" -> null
        }
    }

  # aws_api_gateway_usage_plan.this will be created
  + resource "aws_api_gateway_usage_plan" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "api_gateway_usage_plan"
      + tags_all = {
          + "Environment" = "dev-dev"
          + "Project"     = "levio-aws-demo-fev-dev"
          + "Terraform"   = "true"
        }

      + api_stages {
          + api_id = (known after apply)
          + stage  = "dev"
        }
    }

  # aws_api_gateway_usage_plan_key.api_gateway_usage_plan_key will be destroyed
  # (because aws_api_gateway_usage_plan_key.api_gateway_usage_plan_key is not in configuration)
  - resource "aws_api_gateway_usage_plan_key" "api_gateway_usage_plan_key" {
      - id            = "bqz9cf6p6h" -> null
      - key_id        = "bqz9cf6p6h" -> null
      - key_type      = "API_KEY" -> null
      - name          = "api_gateway_api_key" -> null
      - usage_plan_id = "mhz8po" -> null
      - value         = "bxqy9tcFfY6yqqLzqmOQ71sgIcfXO8G2Do442LB7" -> null
    }

  # aws_api_gateway_usage_plan_key.this will be created
  + resource "aws_api_gateway_usage_plan_key" "this" {
      + id            = (known after apply)
      + key_id        = (known after apply)
      + key_type      = "API_KEY"
      + name          = (known after apply)
      + usage_plan_id = (known after apply)
      + value         = (known after apply)
    }

  # module.inference.module.api_gateway.aws_api_gateway_integration.api_gateway_integration must be replaced
-/+ resource "aws_api_gateway_integration" "api_gateway_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "dv0h4c" -> (known after apply)
      ~ id                      = "agi-9bq31150jd-dv0h4c-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "dv0h4c" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id             = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.inference.module.api_gateway.aws_api_gateway_method.api_gateway_method must be replaced
-/+ resource "aws_api_gateway_method" "api_gateway_method" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-9bq31150jd-dv0h4c-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "dv0h4c" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id          = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.inference.module.api_gateway.aws_api_gateway_resource.api_gateway_resource must be replaced
-/+ resource "aws_api_gateway_resource" "api_gateway_resource" {
      ~ id          = "dv0h4c" -> (known after apply)
      ~ parent_id   = "ic7gx3jk9f" -> (known after apply)
      ~ path        = "/inference" -> (known after apply)
      ~ rest_api_id = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.inference.module.api_gateway.aws_lambda_permission.lambda_permission must be replaced
-/+ resource "aws_lambda_permission" "lambda_permission" {
      ~ id                  = "AllowExecutionFromAPIGateway-levio-demo-fev-inference-dev" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-1:446872271111:9bq31150jd/*/GET/inference" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.inference.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-inference-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:2357998787356dc3f7f90d7f265aea528d1432ea9c8068cf539543ec0317cbaa" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/inference@sha256:43da6fca8ae25ff2acf5dad0391d0c36356ed3720bb7ec7887d70a1ddd79c4a9"
      ~ last_modified                  = "2024-02-12T13:50:09.593+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.ingestion.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-ingestion-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:a122e0f5676879b18320e099b39641804858f56b092771f80ac507a022bd892e" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/ingestion@sha256:ee2f0374fc2fc36144fa5c1fcdf09a3cb0d805427f3414d0f964efaf693d6061"
      ~ last_modified                  = "2024-02-09T23:18:49.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.lex_router.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-lex-router-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:908baab61e46129d83b501c320873e1230e0baa0e49563f3c28159dc37dfda32" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/lex_router@sha256:d5adf813497e6fc2e24d9dd593c412f0aa9ee279057eb725fbe7aa7e0e976fe1"
      ~ last_modified                  = "2024-02-09T23:18:49.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.list_collections.module.api_gateway.aws_api_gateway_integration.api_gateway_integration must be replaced
-/+ resource "aws_api_gateway_integration" "api_gateway_integration" {
      - cache_key_parameters    = [] -> null
      ~ cache_namespace         = "c4yu2h" -> (known after apply)
      ~ id                      = "agi-9bq31150jd-c4yu2h-GET" -> (known after apply)
      ~ passthrough_behavior    = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters      = {} -> null
      - request_templates       = {} -> null
      ~ resource_id             = "c4yu2h" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id             = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.list_collections.module.api_gateway.aws_api_gateway_method.api_gateway_method must be replaced
-/+ resource "aws_api_gateway_method" "api_gateway_method" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-9bq31150jd-c4yu2h-GET" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "c4yu2h" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id          = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.list_collections.module.api_gateway.aws_api_gateway_resource.api_gateway_resource must be replaced
-/+ resource "aws_api_gateway_resource" "api_gateway_resource" {
      ~ id          = "c4yu2h" -> (known after apply)
      ~ parent_id   = "ic7gx3jk9f" -> (known after apply)
      ~ path        = "/collections" -> (known after apply)
      ~ rest_api_id = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.list_collections.module.api_gateway.aws_lambda_permission.lambda_permission must be replaced
-/+ resource "aws_lambda_permission" "lambda_permission" {
      ~ id                  = "AllowExecutionFromAPIGateway-levio-demo-fev-list-collections-dev" -> (known after apply)
      ~ source_arn          = "arn:aws:execute-api:us-east-1:446872271111:9bq31150jd/*/GET/collections" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.list_collections.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-list-collections-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:307d0db53bf6de8e84dc515b14b38ba74f385e2530a60a7e4e003663c330a2e8" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/list_collections@sha256:d10e33d62a6d9a423740500f17198bb0b698846bca4becfff1d27ba2ba7125b8"
      ~ last_modified                  = "2024-02-12T13:50:09.593+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.memory.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "levio-demo-fev-memory-dev"
      ~ image_uri                      = "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:c74b3f2a85a5b198b7563c9d3ae56051d8c8ea80bd128a8e8e5a5a33fb93d48a" -> "446872271111.dkr.ecr.us-east-1.amazonaws.com/conversation_memory@sha256:17f7da23e51e44c266fc0368b1fc0faf5610ddd62d7b155b525c20caa65933df"
      ~ last_modified                  = "2024-02-09T23:18:49.000+0000" -> (known after apply)
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.inference.module.api_gateway.module.cors.aws_api_gateway_integration._ must be replaced
-/+ resource "aws_api_gateway_integration" "_" {
      - cache_key_parameters = [] -> null
      ~ cache_namespace      = "dv0h4c" -> (known after apply)
      ~ id                   = "agi-9bq31150jd-dv0h4c-OPTIONS" -> (known after apply)
      ~ passthrough_behavior = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters   = {} -> null
      ~ resource_id          = "dv0h4c" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id          = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.inference.module.api_gateway.module.cors.aws_api_gateway_integration_response._ must be replaced
-/+ resource "aws_api_gateway_integration_response" "_" {
      ~ id                  = "agir-9bq31150jd-dv0h4c-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "dv0h4c" # forces replacement -> (known after apply) # forces replacement
      - response_templates  = {} -> null
      ~ rest_api_id         = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.inference.module.api_gateway.module.cors.aws_api_gateway_method._ must be replaced
-/+ resource "aws_api_gateway_method" "_" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-9bq31150jd-dv0h4c-OPTIONS" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "dv0h4c" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id          = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.inference.module.api_gateway.module.cors.aws_api_gateway_method_response._ must be replaced
-/+ resource "aws_api_gateway_method_response" "_" {
      ~ id                  = "agmr-9bq31150jd-dv0h4c-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "dv0h4c" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id         = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration._ must be replaced
-/+ resource "aws_api_gateway_integration" "_" {
      - cache_key_parameters = [] -> null
      ~ cache_namespace      = "c4yu2h" -> (known after apply)
      ~ id                   = "agi-9bq31150jd-c4yu2h-OPTIONS" -> (known after apply)
      ~ passthrough_behavior = "WHEN_NO_MATCH" -> (known after apply)
      - request_parameters   = {} -> null
      ~ resource_id          = "c4yu2h" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id          = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (6 unchanged attributes hidden)
    }

  # module.list_collections.module.api_gateway.module.cors.aws_api_gateway_integration_response._ must be replaced
-/+ resource "aws_api_gateway_integration_response" "_" {
      ~ id                  = "agir-9bq31150jd-c4yu2h-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "c4yu2h" # forces replacement -> (known after apply) # forces replacement
      - response_templates  = {} -> null
      ~ rest_api_id         = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method._ must be replaced
-/+ resource "aws_api_gateway_method" "_" {
      - authorization_scopes = [] -> null
      ~ id                   = "agm-9bq31150jd-c4yu2h-OPTIONS" -> (known after apply)
      - request_models       = {} -> null
      - request_parameters   = {} -> null
      ~ resource_id          = "c4yu2h" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id          = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.list_collections.module.api_gateway.module.cors.aws_api_gateway_method_response._ must be replaced
-/+ resource "aws_api_gateway_method_response" "_" {
      ~ id                  = "agmr-9bq31150jd-c4yu2h-OPTIONS-200" -> (known after apply)
      ~ resource_id         = "c4yu2h" # forces replacement -> (known after apply) # forces replacement
      ~ rest_api_id         = "9bq31150jd" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

Plan: 22 to add, 5 to change, 22 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: terraform.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "terraform.tfplan"

```

</details>

*Pusher: @FloRul, Action: `pull_request`, Workflow: `Deploy Lambdas & Terraform Plan on PR`*